---
kind: method
id: M:Autodesk.Revit.DB.Fabrication.DesignToFabricationConverter.#ctor(Autodesk.Revit.DB.Document)
source: html/d9cb2895-587f-07df-6cdd-3ce1f04244c9.htm
---
# Autodesk.Revit.DB.Fabrication.DesignToFabricationConverter.#ctor Method

Creates a new instance of the DesignToFabricationConverter class.

## Syntax (C#)
```csharp
public DesignToFabricationConverter(
	Document document
)
```

## Parameters
- **document** (`Autodesk.Revit.DB.Document`) - A document in which to convert MEP design elements into fabrication parts.

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentNullException** - A non-optional argument was null